# PANDAS

In [1]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

Pandas'ta index numaralarÄ± elementlerle birlikte tutulur

In [3]:
seri = pd.Series([10,88,3,4,5])

In [4]:
type(seri)

pandas.core.series.Series

In [5]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [6]:
seri.dtype

dtype('int64')

In [7]:
seri.size

5

In [8]:
seri.ndim

1

In [9]:
seri.values

array([10, 88,  3,  4,  5], dtype=int64)

In [10]:
seri.head()

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [11]:
seri.head(3)

0    10
1    88
2     3
dtype: int64

In [12]:
seri.tail()

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [13]:
seri.tail(3)

2    3
3    4
4    5
dtype: int64

## naming index

In [14]:
pd.Series([99,22,332,94,5])

0     99
1     22
2    332
3     94
4      5
dtype: int64

In [18]:
pd.Series([99,22,332,94,5], index = [1,3,5,7,9])

1     99
3     22
5    332
7     94
9      5
dtype: int64

In [19]:
pd.Series([99,22,332,94,5], index = ["best","worst","highest","lowest",'a'])

best        99
worst       22
highest    332
lowest      94
a            5
dtype: int64

In [20]:
seri = pd.Series([99,22,332,94,5], index = ["best","worst","highest","lowest",'a'])

In [21]:
seri["worst"]

22

In [24]:
seri["best":"highest"]

best        99
worst       22
highest    332
dtype: int64

## creating list upon dictionary

In [25]:
dict = {"reg": 10, "log": 11, "cart":12}

In [26]:
dict

{'reg': 10, 'log': 11, 'cart': 12}

In [27]:
dictwithseries = pd.Series({"reg": 10, "log": 11, "cart":12})

In [29]:
dictwithseries

reg     10
log     11
cart    12
dtype: int64

In [30]:
dictionary = {"reg": 10, "log": 11, "cart":12}

In [31]:
seri = pd.Series(dictionary)

In [32]:
seri

reg     10
log     11
cart    12
dtype: int64

In [33]:
seri["reg":"log"]

reg    10
log    11
dtype: int64

In [34]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

## Element Operations

In [35]:
import numpy as np
import pandas as pd
a = np.array([1,2,33,444,75])
seri = pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [36]:
seri[3]

444

In [37]:
seri[0:3]

0     1
1     2
2    33
dtype: int32

In [38]:
seri = pd.Series([121,200,150,99], index = ["reg", "log", "cart", "rf"])

In [39]:
seri

reg     121
log     200
cart    150
rf       99
dtype: int64

In [40]:
seri.index

Index(['reg', 'log', 'cart', 'rf'], dtype='object')

In [41]:
seri.keys

<bound method Series.keys of reg     121
log     200
cart    150
rf       99
dtype: int64>

In [42]:
list(seri.items())

[('reg', 121), ('log', 200), ('cart', 150), ('rf', 99)]

In [43]:
seri.values

array([121, 200, 150,  99], dtype=int64)

In [44]:
#element searching

In [45]:
"reg" in seri

True

In [46]:
"LOG" in seri

False

In [47]:
seri["reg"]

121

In [48]:
#fancy index

In [49]:
seri[["rf", "reg"]]

rf      99
reg    121
dtype: int64

In [50]:
seri["reg"] = 1590

In [51]:
seri["reg"]

1590

In [52]:
seri["reg": "log"]

reg    1590
log     200
dtype: int64

## Pandas DataFrame

In [56]:
import pandas as pd

In [57]:
l = [1,2,39,67,90]

In [58]:
l

[1, 2, 39, 67, 90]

In [59]:
pd.DataFrame(l, columns = ["variable_name"])

   variable_name
0              1
1              2
2             39
3             67
4             90

In [60]:
import numpy as np

In [61]:
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [63]:
pd.DataFrame(m, columns = ["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [66]:
pd.DataFrame(m, columns = ["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [67]:
#df naming

In [68]:
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [69]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [70]:
df.columns = ("deg1", "deg2", "deg3")

In [71]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [72]:
type(df)

pandas.core.frame.DataFrame

In [73]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [74]:
df.shape

(3, 3)

In [75]:
df.ndim

2

In [76]:
df.size

9

In [77]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [78]:
type(df.values)

numpy.ndarray

In [80]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

In [81]:
a = np.array([1,2,3,4,5])

In [82]:
pd.DataFrame(a, columns = ["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

## Element Operations

In [83]:
import numpy as np
import pandas as pd

In [84]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [85]:
dictionary = {"var1": s1, "var2": s2, "var3": s3}

In [86]:
dictionary

{'var1': array([7, 4, 9, 6, 7]),
 'var2': array([3, 5, 1, 0, 5]),
 'var3': array([4, 1, 3, 4, 7])}

In [87]:
df = pd.DataFrame(dictionary)

In [88]:
df

   var1  var2  var3
0     7     3     4
1     4     5     1
2     9     1     3
3     6     0     4
4     7     5     7

In [89]:
df[0:1]

   var1  var2  var3
0     7     3     4

In [90]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [91]:
df.index = ["a", "b", "c", "d", "e"]

In [92]:
df

   var1  var2  var3
a     7     3     4
b     4     5     1
c     9     1     3
d     6     0     4
e     7     5     7

In [93]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [94]:
df["c": "e"]

   var1  var2  var3
c     9     1     3
d     6     0     4
e     7     5     7

In [95]:
# deleting

In [96]:
df.drop("a", axis = 0)

   var1  var2  var3
b     4     5     1
c     9     1     3
d     6     0     4
e     7     5     7

In [97]:
df

   var1  var2  var3
a     7     3     4
b     4     5     1
c     9     1     3
d     6     0     4
e     7     5     7

as seen above, drop method did not do any change on actual dataframe but we can control that

In [98]:
df.drop("a", axis = 0, inplace = True)

In [99]:
df

   var1  var2  var3
b     4     5     1
c     9     1     3
d     6     0     4
e     7     5     7

In [100]:
#fancy

In [102]:
l = ["c", "e"]

In [103]:
df.drop(l, axis=0)

   var1  var2  var3
b     4     5     1
d     6     0     4

In [104]:
df

   var1  var2  var3
b     4     5     1
c     9     1     3
d     6     0     4
e     7     5     7

In [105]:
"var1" in df

True

In [106]:
l = ["var1", "var4", "var2"]

In [108]:
for i in l:
    print(i in df)

True
False
True

In [109]:
df

   var1  var2  var3
b     4     5     1
c     9     1     3
d     6     0     4
e     7     5     7

In [110]:
df["var4"] = df["var1"] / df["var2"]

In [111]:
df

   var1  var2  var3  var4
b     4     5     1   0.8
c     9     1     3   9.0
d     6     0     4   inf
e     7     5     7   1.4

In [112]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     4     5     1
c     9     1     3
d     6     0     4
e     7     5     7

In [113]:
df

   var1  var2  var3  var4
b     4     5     1   0.8
c     9     1     3   9.0
d     6     0     4   inf
e     7     5     7   1.4

In [114]:
df.drop("var4", axis = 1, inplace = True)

In [115]:
df

   var1  var2  var3
b     4     5     1
c     9     1     3
d     6     0     4
e     7     5     7

In [116]:
l = ["var1","var2"]

In [117]:
df.drop(l, axis = 1)

   var3
b     1
c     3
d     4
e     7

## Subset Observations and Variables: _loc & iloc_

In [118]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0    22    27    13
1    16    28    18
2    26    17    15
3    20    10     6
4    11    21    27
5     6    13    13
6    11    14    21
7    27     1    12
8    23    10    13
9    15     5    20

In [119]:
# loc: tanÄ±mlandÄ±ÄÄ± Åekli ile seÃ§im yapmak iÃ§in kullanÄ±lÄ±r.

In [120]:
df.loc[0:3]

   var1  var2  var3
0    22    27    13
1    16    28    18
2    26    17    15
3    20    10     6

In [121]:
#iloc: alÄ±ÅÄ±k olduÄumuz indeksleme mantÄ±ÄÄ± ile seÃ§im yapar

In [122]:
df.iloc[0:3]

   var1  var2  var3
0    22    27    13
1    16    28    18
2    26    17    15

yani son indeks dahil olursa loc olmazsa iloc

In [123]:
df

   var1  var2  var3
0    22    27    13
1    16    28    18
2    26    17    15
3    20    10     6
4    11    21    27
5     6    13    13
6    11    14    21
7    27     1    12
8    23    10    13
9    15     5    20

In [124]:
df.iloc[:3,:2]

   var1  var2
0    22    27
1    16    28
2    26    17

In [125]:
df.loc[0:3, "var3"]

0    13
1    18
2    15
3     6
Name: var3, dtype: int32

In [126]:
df.iloc[0:3, "var3"]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

as seen above, if we include index, we cannot do it with iloc

In [127]:
df.iloc[0:3, 1:3]

   var2  var3
0    27    13
1    28    18
2    17    15

In [128]:
df.iloc[0:3]["var3"]

0    13
1    18
2    15
Name: var3, dtype: int32

## Conditional Element Operations

In [129]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0    22    23     2
1    18    14    22
2     8     1     6
3    24    13    11
4    20    22    15
5    17     8     2
6    20    20     1
7     6    11    27
8    24    19     4
9    22    25    24

In [130]:
df["var1"]

0    22
1    18
2     8
3    24
4    20
5    17
6    20
7     6
8    24
9    22
Name: var1, dtype: int32

In [131]:
df["var1"][0:1]

0    22
Name: var1, dtype: int32

In [132]:
df[0:1]

   var1  var2  var3
0    22    23     2

In [135]:
#df[0:2]["var1","var2"]  #calÄ±Åmaz, fancy gerek

In [136]:
df

   var1  var2  var3
0    22    23     2
1    18    14    22
2     8     1     6
3    24    13    11
4    20    22    15
5    17     8     2
6    20    20     1
7     6    11    27
8    24    19     4
9    22    25    24

In [137]:
df.var1

0    22
1    18
2     8
3    24
4    20
5    17
6    20
7     6
8    24
9    22
Name: var1, dtype: int32

In [139]:
df[df.var1 > 20]

   var1  var2  var3
0    22    23     2
3    24    13    11
8    24    19     4
9    22    25    24

In [140]:
df[(df.var1 > 20) & (df.var3<5)]

   var1  var2  var3
0    22    23     2
8    24    19     4

In [142]:
df.loc[(df.var1 > 15), ["var1", "var2"]] # loc olmasaydÄ± Ã§alÄ±ÅmazdÄ±

   var1  var2
0    22    23
1    18    14
3    24    13
4    20    22
5    17     8
6    20    20
8    24    19
9    22    25

In [143]:
df[(df.var1>20)][["var1", "var2"]]

   var1  var2
0    22    23
3    24    13
8    24    19
9    22    25

## Join Operations

In [146]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df1

   var1  var2  var3
0     2    13     9
1    11     9    15
2    17     3     7
3    20    29    29
4     5    11    28

In [147]:
df2 = df1 + 99

In [148]:
df2

   var1  var2  var3
0   101   112   108
1   110   108   114
2   116   102   106
3   119   128   128
4   104   110   127

In [149]:
pd.concat([df1,df2])

   var1  var2  var3
0     2    13     9
1    11     9    15
2    17     3     7
3    20    29    29
4     5    11    28
0   101   112   108
1   110   108   114
2   116   102   106
3   119   128   128
4   104   110   127

but there is a problem with indexes and we can solve this by ignore_index. (to see solution of problem, we checked ?pd.concat to see what it has. just putting question mark ?pd.concat)

In [152]:
pd.concat([df1, df2],  ignore_index= True)

   var1  var2  var3
0     2    13     9
1    11     9    15
2    17     3     7
3    20    29    29
4     5    11    28
5   101   112   108
6   110   108   114
7   116   102   106
8   119   128   128
9   104   110   127

In [153]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [154]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [157]:
df2.columns = ["var1", "var2", "deg3"]

In [158]:
df2

   var1  var2  deg3
0   101   112   108
1   110   108   114
2   116   102   106
3   119   128   128
4   104   110   127

In [159]:
df1

   var1  var2  var3
0     2    13     9
1    11     9    15
2    17     3     7
3    20    29    29
4     5    11    28

In [160]:
pd.concat([df1,df2])

   var1  var2  var3   deg3
0     2    13   9.0    NaN
1    11     9  15.0    NaN
2    17     3   7.0    NaN
3    20    29  29.0    NaN
4     5    11  28.0    NaN
0   101   112   NaN  108.0
1   110   108   NaN  114.0
2   116   102   NaN  106.0
3   119   128   NaN  128.0
4   104   110   NaN  127.0

In [161]:
pd.concat([df1, df2], join="inner")

   var1  var2
0     2    13
1    11     9
2    17     3
3    20    29
4     5    11
0   101   112
1   110   108
2   116   102
3   119   128
4   104   110

In [164]:
pd.concat([df1, df2], join="inner", ignore_index=True)

   var1  var2
0     2    13
1    11     9
2    17     3
3    20    29
4     5    11
5   101   112
6   110   108
7   116   102
8   119   128
9   104   110

In [165]:
pd.concat([df1, df2], join="outer", ignore_index=True)

   var1  var2  var3   deg3
0     2    13   9.0    NaN
1    11     9  15.0    NaN
2    17     3   7.0    NaN
3    20    29  29.0    NaN
4     5    11  28.0    NaN
5   101   112   NaN  108.0
6   110   108   NaN  114.0
7   116   102   NaN  106.0
8   119   128   NaN  128.0
9   104   110   NaN  127.0

In [170]:
pd.concat([df1, df2], join_axes = [df1.columns])

TypeError: concat() got an unexpected keyword argument 'join_axes'

## Advanced Join Operations

In [171]:
import pandas as pd

In [172]:
#one-to-one join

In [173]:
df1 = pd.DataFrame({'workers': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                   'group': ['Accountant', 'Engineering', 'Engineering', 'HR']})
df1

  workers        group
0     Ali   Accountant
1    Veli  Engineering
2    Ayse  Engineering
3   Fatma           HR

In [174]:
df2 = pd.DataFrame({'workers': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                   'starting': [2010, 2009, 2014, 2019]})
df2

  workers  starting
0     Ali      2010
1    Veli      2009
2    Ayse      2014
3   Fatma      2019

In [175]:
pd.merge(df1, df2)

  workers        group  starting
0     Ali   Accountant      2010
1    Veli  Engineering      2009
2    Ayse  Engineering      2014
3   Fatma           HR      2019

In [179]:
pd.merge(df1, df2, on = "workers")

  workers        group  starting
0     Ali   Accountant      2010
1    Veli  Engineering      2009
2    Ayse  Engineering      2014
3   Fatma           HR      2019

In [180]:
#many-to-one

In [181]:
df3 = pd.merge(df1, df2)
df3

  workers        group  starting
0     Ali   Accountant      2010
1    Veli  Engineering      2009
2    Ayse  Engineering      2014
3   Fatma           HR      2019

In [182]:
df4 = pd.DataFrame({'group': ["Accountant", "Engineering", "HR"],
                   "supervisor": ['Caner', 'Mustafa', 'Berkcan']})
df4

         group supervisor
0   Accountant      Caner
1  Engineering    Mustafa
2           HR    Berkcan

In [183]:
pd.merge(df3, df4)

  workers        group  starting supervisor
0     Ali   Accountant      2010      Caner
1    Veli  Engineering      2009    Mustafa
2    Ayse  Engineering      2014    Mustafa
3   Fatma           HR      2019    Berkcan

In [184]:
#many-to-many

In [186]:
df5 = pd.DataFrame({'group': ['Accountant', 'Accountant', 'Engineering', 'Engineering', 'HR', 'HR'],
                   'abilities': ['math', 'excel', 'codding', 'linux', 'excel', 'management']})
df5

         group   abilities
0   Accountant        math
1   Accountant       excel
2  Engineering     codding
3  Engineering       linux
4           HR       excel
5           HR  management

In [187]:
df1

  workers        group
0     Ali   Accountant
1    Veli  Engineering
2    Ayse  Engineering
3   Fatma           HR

In [188]:
pd.merge(df1, df5)

  workers        group   abilities
0     Ali   Accountant        math
1     Ali   Accountant       excel
2    Veli  Engineering     codding
3    Veli  Engineering       linux
4    Ayse  Engineering     codding
5    Ayse  Engineering       linux
6   Fatma           HR       excel
7   Fatma           HR  management

## Aggregation & Grouping (ToplulaÅtÄ±rma ve Gruplama)

count()
first()
last()
mean()
median()
min()
max()
std()
var()
sum()

In [189]:
import seaborn as sns

In [190]:
df = sns.load_dataset("planets")

In [192]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [193]:
df.shape

(1035, 6)

In [194]:
df.mean()

C:\Users\Eray\AppData\Local\Temp\ipykernel_63388\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [195]:
df["mass"].mean()

2.6381605847953233

In [196]:
df["mass"].count()

513

In [197]:
df["mass"].min()

0.0036

In [198]:
df["mass"].max()

25.0

In [199]:
df["mass"].sum()

1353.37638

In [207]:
df["mass"].std()  # standard sapma

3.8186166509616046

In [208]:
df["mass"].var()  # variance

14.58183312700122

In [209]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [210]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [211]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

### Grouping

In [213]:
df = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                  'data': [10,11,52,23,43,55]}, columns=['groups', 'data'])
df

  groups  data
0      A    10
1      B    11
2      C    52
3      A    23
4      B    43
5      C    55

In [216]:
df.groupby("groups")

In [218]:
df.groupby("groups").mean()

        data
groups
A       16.5
B       27.0
C       53.5

In [224]:
df.groupby('groups').sum()

KeyError: 'groups'

In [225]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [226]:
df.groupby("method")

In [228]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [229]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [230]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

### Advanced Aggregation (Aggregate, filter, transform, apply)

In [232]:
import pandas as pd
df = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                  'var1': [10,23,33,22,11,99],
                  'var2': [100,253,333,262,111,969]},
                 columns = ['groups', 'var1', 'var2'])
df

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [233]:
#aggregate

In [234]:
df.groupby("groups").mean()

        var1   var2
groups
A       16.0  181.0
B       17.0  182.0
C       66.0  651.0

In [237]:
df.groupby("groups").aggregate(["min", np.median, max])  #min pandasÄ±n iÃ§inde diye, median numpydan ve max Ã¶yle

       var1            var2
        min median max  min median  max
groups
A        10   16.0  22  100  181.0  262
B        11   17.0  23  111  182.0  253
C        33   66.0  99  333  651.0  969

In [238]:
df.groupby("groups").aggregate({"var1": "min",
                               "var2": "max"})

        var1  var2
groups
A         10   262
B         11   253
C         33   969

In [239]:
# filter

In [240]:
import pandas as pd
df = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                  'var1': [10,23,33,22,11,99],
                  'var2': [100,253,333,262,111,969]},
                 columns = ['groups', 'var1', 'var2'])
df

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [243]:
def filter_func(x):
    return x["var1"].std() > 9

In [245]:
df.groupby("groups").std()

             var1        var2
groups
A        8.485281  114.551299
B        8.485281  100.409163
C       46.669048  449.719913

In [246]:
df.groupby("groups").filter(filter_func)

  groups  var1  var2
2      C    33   333
5      C    99   969

In [247]:
#transform

In [248]:
import pandas as pd
df = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                  'var1': [10,23,33,22,11,99],
                  'var2': [100,253,333,262,111,969]},
                 columns = ['groups', 'var1', 'var2'])
df

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [249]:
df["var1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: var1, dtype: int64

In [254]:
df_a = df.iloc[:,1:3]

In [256]:
df_a.transform(lambda x: (x-x.mean()) / x.std())

       var1      var2
0 -0.687871 -0.738461
1 -0.299074 -0.263736
2  0.000000 -0.015514
3 -0.328982 -0.235811
4 -0.657963 -0.704331
5  1.973890  1.957853

In [257]:
#apply

In [258]:
import pandas as pd
df = pd.DataFrame({'var1': [10,23,33,22,11,99],
                  'var2': [100,253,333,262,111,969]},
                 columns = ['var1', 'var2'])
df

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [259]:
df.apply(np.sum)

var1     198
var2    2028
dtype: int64

In [260]:
df.apply(np.mean)

var1     33.0
var2    338.0
dtype: float64

In [261]:
import pandas as pd
df = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                  'var1': [10,23,33,22,11,99],
                  'var2': [100,253,333,262,111,969]},
                 columns = ['groups', 'var1', 'var2'])
df

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [262]:
df.groupby("groups").apply(np.mean)

C:\Users\Eray\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\Eray\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

        var1   var2
groups
A       16.0  181.0
B       17.0  182.0
C       66.0  651.0

### Pivot tables

In [263]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [264]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [265]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [270]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()*100  #to see percent form

         survived
class       First     Second      Third
sex
female  96.808511  92.105263  50.000000
male    36.885246  15.740741  13.544669

In [272]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean") #unstack ile daha hiyerarÅik bir gÃ¶rÃ¼nÃ¼Å

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [273]:
#table with pivot

In [274]:
titanic.pivot_table("survived", index = "sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [275]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [ ]:
age = pd.cut(titanic["age"], [0, 18, 90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [277]:
titanic.pivot_table("survived", ["sex", age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

yani yaÅÄ± 0dan 18e 18den 90a ikiye ayÄ±rdÄ±k

## Reading data from outer sources

In [278]:
import pandas as pd

In [283]:
#csv okuma
pd.read_csv("reading_data/ornekcsv.csv")

       a;b;c
0    78;12;1
1    78;12;2
2   78;324;3
3      7;2;4
4    88;23;5
5       6;2;
6    56;11;6
7     7;12;7
8    56;21;7
9    346;2;8
10     5;1;8
11  456;21;8
12   3;12;88

In [284]:
#csv okuma ve separate methodu ile temizleme
pd.read_csv("reading_data/ornekcsv.csv", sep = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [285]:
#txt okuma
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [286]:
#excel okuma
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [287]:
df = pd.read_excel("reading_data/ornekx.xlsx")

In [288]:
type(df)

pandas.core.frame.DataFrame

In [289]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [290]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [295]:
df.columns = ["A", "B", "C"]  #normal parantez de oluyor

In [296]:
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [297]:
#sÄ±fÄ±rdan txt okuma
tips = pd.read_csv("reading_data/data.txt")

In [298]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4